In [1]:
import pandas as pd

In [26]:
data = {'Name':['Anthony','Steve','Sarah','John','Bucky','Tony','Pepper']
        ,'Department':['Sales','IT','Engineering','Engineering','Marketing','IT','Sales']
        ,'Salary':[60000,80000,55000,74000,65200,88520,71225]
        ,'Age':[25,23,24,30,31,35,37]}

df = pd.DataFrame(data=data)

In [27]:
df

      Name   Department  Salary  Age
0  Anthony        Sales   60000   25
1    Steve           IT   80000   23
2    Sarah  Engineering   55000   24
3     John  Engineering   74000   30
4    Bucky    Marketing   65200   31
5     Tony           IT   88520   35
6   Pepper        Sales   71225   37

In [28]:
df.to_csv('file1.csv')

In [19]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.7/dist-packages (3.1.1)
Requirement already satisfied: py4j==0.10.9 in /usr/local/lib/python3.7/dist-packages (from pyspark) (0.10.9)

In [20]:
from pyspark.sql import SparkSession

In [21]:
spark = SparkSession.builder.appName('Aggregate').getOrCreate()

In [22]:
spark

In [29]:
df_pyspark = spark.read.csv('file1.csv',header=True,inferSchema=True)

In [30]:
df_pyspark.show()

+---+-------+-----------+------+---+
|_c0|   Name| Department|Salary|Age|
+---+-------+-----------+------+---+
|  0|Anthony|      Sales| 60000| 25|
|  1|  Steve|         IT| 80000| 23|
|  2|  Sarah|Engineering| 55000| 24|
|  3|   John|Engineering| 74000| 30|
|  4|  Bucky|  Marketing| 65200| 31|
|  5|   Tony|         IT| 88520| 35|
|  6| Pepper|      Sales| 71225| 37|
+---+-------+-----------+------+---+

In [31]:
df_pyspark.printSchema()

root
 |-- _c0: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Age: integer (nullable = true)

#### Groupby

In [32]:
df_pyspark.groupby('Name').sum()

DataFrame[Name: string, sum(_c0): bigint, sum(Salary): bigint, sum(Age): bigint]

In [34]:
df_pyspark.groupby('Name').sum('Salary').show()

+-------+-----------+
|   Name|sum(Salary)|
+-------+-----------+
|  Steve|      80000|
|  Bucky|      65200|
| Pepper|      71225|
|  Sarah|      55000|
|   John|      74000|
|   Tony|      88520|
|Anthony|      60000|
+-------+-----------+

In [36]:
df_pyspark.groupby('Department').mean('Age').show()

+-----------+--------+
| Department|avg(Age)|
+-----------+--------+
|      Sales|    31.0|
|Engineering|    27.0|
|  Marketing|    31.0|
|         IT|    29.0|
+-----------+--------+

In [38]:
df_pyspark.groupby('Department').count().show()

+-----------+-----+
| Department|count|
+-----------+-----+
|      Sales|    2|
|Engineering|    2|
|  Marketing|    1|
|         IT|    2|
+-----------+-----+

In [40]:
df_pyspark.groupby().sum('Salary').show()

+-----------+
|sum(Salary)|
+-----------+
|     493945|
+-----------+

In [41]:
df_pyspark.agg({'Salary':'Sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|     493945|
+-----------+